Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: The **HDMI Displays** sport an HDMI interface for streamlined integration with PCs or SBCs.
it_it: Gli **HDMI Displays** sono dotati di un'interfaccia HDMI per un'integrazione semplificata con PC o SBC.

source: The **OpenGL** display driver is a generic driver that creates textures for embedding LVGL content in other applications.
it_it: Il driver di display **OpenGL** è un driver generico che crea texture per l'embedding di contenuti LVGL in altre applicazioni.

source: The **SHM (Shared Memory)** backend is the default rendering backend used by the Wayland driver.
it_it: Il backend **SHM (Shared Memory)** è quello di default utilizzato dal driver Wayland.

source: The **UEFI** display/input `driver <https://github.com/lvgl/lvgl/src/drivers/uefi>`__ offers support for using LVGL to create UIs in UEFI environments.
it_it: Il `driver <https://github.com/lvgl/lvgl/src/drivers/uefi>`__ di visualizzazione/input **UEFI** offre supporto per l'utilizzo di LVGL per creare interfacce utente in ambienti UEFI.

source: The **Windows** display/input `driver <https://github.com/lvgl/lvgl/tree/master/src/drivers/windows>`__ offers support for simulating the LVGL display and keyboard/mouse inputs in a Windows Win32 window.
it_it: Il `driver <https://github.com/lvgl/lvgl/tree/master/src/drivers/windows>`__ di display/input di **Windows** offre supporto per la simulazione del display LVGL e degli input da tastiera/mouse in una finestra Win32 di Windows.

source: The **X11** display/input `driver <https://github.com/lvgl/lvgl/src/drivers/x11>`__ offers support for simulating the LVGL display and keyboard/mouse inputs in an X11 desktop window.
it_it: Il `driver <https://github.com/lvgl/lvgl/src/drivers/x11>`__ Display/Input **X11** offre supporto per la simulazione del display LVGL e degli input da tastiera/mouse in una finestra del desktop X11.

source: The **format** property also affects the amount of memory needed to store a font.
it_it: La proprietà **format** influisce anche sulla quantità di memoria necessaria per memorizzare un font.

source: The *target* parameter of the event is always the current target Widget, not the original Widget.
it_it: Il parametro *target* dell'evento è sempre il Widget di destinazione corrente, non il Widget originale.

source: The 3 functions that then become available are:
it_it: Le 3 funzioni che diventano disponibili sono:

source: The :cpp:expr:`LV_COLOR_FORMAT_I1` format assumes that bytes are mapped to rows (i.e., the bits of a byte are written next to each other).
it_it: Il formato :cpp:expr:`LV_COLOR_FORMAT_I1` presuppone che i byte siano mappati su righe (ovvero, i bit di un byte siano scritti uno accanto all'altro).

source: The :cpp:expr:`lv_dropdown_add_option(dropdown, "New option", pos)` function inserts a new option at index ``pos``.
it_it: La funzione :cpp:expr:`lv_dropdown_add_option(dropdown, "New option", pos)` inserisce una nuova opzione all'indice ``pos``.

source: The :cpp:expr:`lv_led_toggle(led)` toggles between the ON and OFF state.
it_it: :cpp:expr:`lv_led_toggle(led)` alterna tra lo stato ON e OFF.

source: The :cpp:func:`lv_draw_sw_i1_convert_to_vtiled` function is used to convert a draw buffer in I1 color format from a row-wise (htiled) to a column-wise (vtiled) buffer layout.
it_it: La funzione :cpp:func:`lv_draw_sw_i1_convert_to_vtiled` viene utilizzata per convertire un buffer di disegno in formato colore I1 da un layout di buffer per riga (htiled) a uno per colonna (vtiled).

source: The :cpp:type:`lv_draw_arc_dsc_t` arc descriptor defines arc rendering with these fields:
it_it: Il descrittore di disegno dell'arco :cpp:type:`lv_draw_arc_dsc_t` definisce il rendering dell'arco con questi campi:

source: The :cpp:type:`lv_draw_border_dsc_t` border descriptor has radius, opacity, width, color, and side fields.
it_it: Il descrittore del bordo :cpp:type:`lv_draw_border_dsc_t` ha i campi raggio, opacità, larghezza, colore e lato.

source: The :cpp:type:`lv_draw_box_shadow_dsc_t` box shadow descriptor describes a **rounded rectangle-shaped shadow**.
it_it: Il descrittore di disegno dell'ombra a riquadro :cpp:type:`lv_draw_box_shadow_dsc_t` descrive un'**ombra rettangolare arrotondata**.

source: The :cpp:type:`lv_draw_image_dsc_t` image descriptor defines the parameters for image drawing.
it_it: Il descrittore dell'immagine :cpp:type:`lv_draw_image_dsc_t` definisce i parametri per il disegno dell'immagine.

source: The :cpp:type:`lv_draw_label_dsc_t` label descriptor provides extensive options for controlling text rendering:
it_it: Il descrittore dell'etichetta :cpp:type:`lv_draw_label_dsc_t` offre ampie opzioni per il controllo del rendering del testo:

source: The :cpp:type:`lv_draw_line_dsc_t` line descriptor defines line rendering with these fields:
it_it: Il descrittore della linea :cpp:type:`lv_draw_line_dsc_t` definisce il rendering della linea con questi campi:

source: The :cpp:type:`lv_fs_drv_t` variable needs to be static, global or dynamically allocated and not a local variable, since its contents need to remain valid as long as the driver is in use.
it_it: La variabile :cpp:type:`lv_fs_drv_t` deve essere statica, globale o allocata dinamicamente e non locale, poiché il suo contenuto deve rimanere valido finché il driver è in uso.

source: The :ref:`CLI tool <editor_cli>` can also synchronize styles from Figma in CI/CD:
it_it: Lo strumento :ref:`CLI tool <editor_cli>` può anche sincronizzare gli stili da Figma in CI/CD:

source: The :ref:`draw_buffers` assigned to it
it_it: I :ref:`draw_buffers` assegnati

source: The :ref:`flush_callback` function that moves pixels from :ref:`draw_buffers` to Display hardware
it_it: La funzione :ref:`flush_callback` che sposta i pixel dal :ref:`draw_buffers` all'hardware del Display

source: The API exposes a struct with both function pointer member and ``user_data`` member
it_it: L'API espone una struct con sia un membro puntatore a funzione che un membro ``user_data``

source: The API of the Widgets is described in their :ref:`Documentation <widgets>`, but you can also consult each Widget's respective header file (e.g., *widgets/lv_slider.h*) to find a quick reference to function prototypes with brief documentation about each.
it_it: L'API dei Widget è descritta nella loro :ref:`Documentazione <widgets>`, ma è anche possibile consultare il rispettivo file header di ciascun Widget (ad esempio, *widgets/lv_slider.h*) per trovare un rapido riferimento ai prototipi di funzione con una breve documentazione su ciascuno.

source: The API-page generation logic will add at most 1 link to each API documentation page containing matched symbols.
it_it: La logica di generazione delle pagine API aggiungerà al massimo 1 link a ciascuna pagina di documentazione API contenente simboli corrispondenti.

source: The Arc Label does not define specific key bindings beyond those inherited from the base object class.
it_it: L'Arc Label non definisce associazioni specifiche di tasti oltre a quelle ereditate dalla classe dell'oggetto base.

source: The Arc Label is a specialized widget designed to display text along an arc.
it_it: La Arc Label è un widget specializzato progettato per visualizzare il testo lungo un arco.

source: The Arc Label primarily inherits events from the base object class.
it_it: L'Arc Label eredita principalmente gli eventi dalla classe dell'oggetto base.

source: The Arc can be one of the following modes:
it_it: L'Arco può essere una delle seguenti modalità:

source: The Arc consists of a background and a foreground arc.
it_it: L'Arc è costituito da un arco sullo sfondo e da uno in primo piano.

source: The Arc's size and position will respect the *padding* style properties.
it_it: Le dimensioni e la posizione dell'Arco rispetteranno le proprietà di stile *padding*.

source: The Arm2D repository contains several examples and templates; however, ensure that only ``Arm-2D/Library/Source`` is compiled.
it_it: Il repository Arm2D contiene diversi esempi e template; tuttavia, assicurarsi che venga compilato solo ``Arm-2D/Library/Source``.

source: The BMP file's color format needs to match the configured :c:macro:`LV_COLOR_DEPTH` of the display on which it will be rendered.
it_it: Il formato colore del file BMP deve corrispondere al :c:macro:`LV_COLOR_DEPTH` configurato per il display su cui verrà visualizzato.

source: The Bar Widget has a background and an indicator.
it_it: Il Widget "Bar" [barra] ha uno sfondo e un indicatore.

source: The Bar can be one of the following modes:
it_it: La Bar può essere in una delle seguenti modalità:

source: The Base Widget can have:
it_it: Il Widget Base può avere:

source: The BitBake task executor together with various types of configuration files form the OpenEmbedded-Core (OE-Core).
it_it: L'esecutore di task BitBake, insieme a vari tipi di file di configurazione, costituisce l'OpenEmbedded-Core (OE-Core).

source: The Button Matrix Widget is a lightweight way to display multiple Buttons in rows and columns --- lightweight because the buttons are not actually created but just virtually drawn on the fly.
it_it: Il Widget "Button Matrix" [Matrice Pulsanti] è un modo semplice per visualizzare più pulsanti in righe e colonne, semplice perché i pulsanti non vengono effettivamente creati, ma solo disegnati virtualmente al volo.

source: The CMSIS DSP library also needs to be added to the project.
it_it: Anche la libreria CMSIS DSP deve essere aggiunta al progetto.

source: The CMakePresets.json file describes some cmake configurations and build phase.
it_it: Il file CMakePresets.json descrive alcune configurazioni di CMake e la fase di compilazione.

source: The CONFIG_LV_Z_MEM_POOL_SIZE parameter defines the LVGL heap size in bytes.
it_it: Il parametro CONFIG_LV_Z_MEM_POOL_SIZE definisce la dimensione dell'heap LVGL in byte.

source: The CPU is available for other operations while the G2D is running.
it_it: La CPU è disponibile per altre operazioni mentre G2D è in esecuzione.

source: The CPU is available for other operations while the GPU is running.
it_it: La CPU è disponibile per altre operazioni mentre la GPU è in esecuzione.

source: The CPU is available for other operations while the PXP is running.
it_it: La CPU è disponibile per altre operazioni mentre PXP è in esecuzione.

source: The CPU is available for other operations while the VGLite is running.
it_it: La CPU è disponibile per altre operazioni mentre VGLite è in esecuzione.

source: The Calendar Widget is a classic calendar which can:
it_it: Il Widget "Calendar" è un calendario classico che può:

source: The Calendar is added to the default group (if one is set).
it_it: Il Calendar viene aggiunto al gruppo di default (se impostato).

source: The Canvas needs a buffer in which to store the drawn image.
it_it: Il Canvas necessita di un buffer in cui memorizzare l'immagine disegnata.

source: The Checkbox Widget is created from a "tick box" and a label.
it_it: Il Widget Checkbox viene creato da una "tick box" [casella di controllo] e da un'etichetta.

source: The Checkbox is added to the default group (if one is set).
it_it: La Checkbox viene aggiunta al gruppo di default (se impostato).

source: The Chinese calendar is a traditional cultural tool that integrates elements such as the lunar calendar, solar terms, and traditional festivals.
it_it: Il calendario cinese è uno strumento culturale tradizionale che integra elementi come il calendario lunare, i termini solari e le festività tradizionali.

source: The Colibri Arm\ |reg| family consists of SODIMM-sized System on Modules (SoM) / Computer on Modules (CoM).
it_it: La famiglia The Colibri Arm\ |reg| è composta da System on Module (SoM) / Computer on Module (CoM) di dimensioni SODIMM.

source: The Colibri family delivers cost-performance-optimized designs.
it_it: La famiglia Colibri offre progetti ottimizzati in termini di costi e prestazioni.

source: The Compilation task compiles the source code if any compilation steps are available and generates a binary file.
it_it: Il task Compilation compila il codice sorgente se sono disponibili passaggi di compilazione e genera un file binario.

source: The Component properties are just XML attributes.
it_it: Le proprietà dei Componenti sono semplicemente attributi XML.

source: The Configuration task configures the source by enabling and disabling any build-time and configuration options for the software being built before compilation if any configuration is available.
it_it: Il task di configurazione configura il codice sorgente abilitando e disabilitando eventuali opzioni di build e di configurazione per il software in fase di compilazione prima della compilazione, se disponibile.

source: The DRM driver can also be combined with :ref:`egl_driver` for hardware-accelerated rendering via EGL/GLES.
it_it: Il driver DRM può anche essere combinato con :ref:`egl_driver` per il rendering con accelerazione hardware tramite EGL/GLES.

source: The DRM driver can optionally use **GBM** (Generic Buffer Management) for buffer allocation.
it_it: Il driver DRM può facoltativamente utilizzare **GBM** (Generic Buffer Management) per l'allocazione del buffer.

source: The DRM driver interacts directly with the GPU or display controller through ``/dev/dri/cardX`` nodes.
it_it: Il driver DRM interagisce direttamente con la GPU o il controller video tramite i nodi ``/dev/dri/cardX``.

source: The DRM driver requires:
it_it: Il driver DRM richiede:

source: The Downloads folder is a fundamental part of the Yocto build environment, serving as a local cache for all external sources and dependencies.
it_it: La cartella Downloads è una parte fondamentale dell'ambiente di build di Yocto, in quanto funge da cache locale per tutte le sorgenti e le dipendenze esterne.

source: The Drop-Down List Widget is built from the elements: "button" and "list" (lightweight versions of the Button and List Widgets).
it_it: Il Widget Drop-Down List è costituito dagli elementi: "button" e "list" (versioni semplificate dei Widget Button e List).

source: The Drop-Down List allows the user to select a value from a list.
it_it: La Drop-Down List [elenco a discesa] consente all'utente di selezionare un valore da un elenco.

source: The Drop-Down List is closed by default and displays a single value or predefined text.
it_it: La Drop-Down List è chiusa per default e visualizza un singolo valore o un testo predefinito.

source: The Drop-down list is added to the default group (if one is set).
it_it: La Drop-down List viene aggiunta al gruppo di default (se impostato).

source: The Drop-down list is an editable Widget allowing list-item selection via encoder or keyboard navigation as well.
it_it: La Drop-Down list è un widget modificabile che consente la selezione degli elementi dell'elenco anche tramite codificatore o navigazione da tastiera.

source: The EGL display driver offers support for creating LVGL displays using the EGL (Embedded-System Graphics Library) API that can be used in an OpenGL context.
it_it: Il driver di visualizzazione EGL offre supporto per la creazione di display LVGL utilizzando l'API EGL (Embedded-System Graphics Library), utilizzabile in un contesto OpenGL.

source: The Editor Pane appears in the middle of the window.
it_it: Il Pannello Editor appare al centro della finestra.

source: The Editor can also recompile its preview from LVGL and custom widgets written in C.
it_it: L'Editor può anche ricompilare la sua anteprima da LVGL e widget personalizzati scritti in C.

source: The Editor can run as:
it_it: L'Editor può essere eseguito come:

source: The Editor is also capable of exporting C code and even recompiling its preview to run custom C code.
it_it: L'Editor è anche in grado di esportare codice C e persino di ricompilare la sua anteprima per eseguire codice C personalizzato.

source: The Editor is capable of recompiling the preview to use and run your C code as well.
it_it: L'Editor è in grado di ricompilare l'anteprima per utilizzarla ed eseguire anche il codice C.

source: The Editor makes UI development much faster by providing features like:
it_it: L'Editor velocizza notevolmente lo sviluppo dell'interfaccia utente offrendo funzionalità quali:

source: The Esp-box devkit meets this spec and https://github.com/espressif/esp-box is a great starting point to adding lottie animations.
it_it: Il devkit Esp-box soddisfa questa specifica e https://github.com/espressif/esp-box è un ottimo punto di partenza per aggiungere animazioni lottie.

source: The Espressif IDF LVGL port component also offers hardware acceleration for the display operations, that is it, once the LVGL render completes an operation and the draw buffer is already handled to the display driver, the Espressif component can optionally perform mirror and rotation of the rendered data using hardware assistance.
it_it: Il porting del componente LVGL IDF di Espressif offre anche accelerazione hardware per le operazioni di visualizzazione: una volta che il rendering LVGL completa un'operazione e il buffer di disegno è già stato gestito dal driver del display, il componente Espressif può opzionalmente eseguire il mirroring e la rotazione dei dati renderizzati tramite l'hardware.

source: The Espressif targets that support the PPA are:
it_it: I target Espressif che supportano il PPA sono:

source: The FFmpeg is an LVGL extension that interfaces with the official FFmpeg library to help you add platform-independent recording, converting and streaming audio and video into your LVGL UI.
it_it: FFmpeg è un'estensione LVGL che si interfaccia con la libreria ufficiale FFmpeg per aiutare ad aggiungere funzionalità di registrazione, conversione e streaming audio e video indipendenti dalla piattaforma nell'interfaccia utente LVGL.

source: The Figma to LVGL Plugin
it_it: Il plugin Figma-LVGL

source: The Figma to LVGL Plugin is available publicly in Figma's plugin store and can be added to both public and private projects, even without a Figma subscription.
it_it: Il plugin Figma-LVGL è disponibile pubblicamente nello store dei plugin di Figma e può essere aggiunto a progetti sia pubblici che privati, anche senza un abbonamento a Figma.

source: The Flexbox (or Flex for short) is a subset of `CSS Flexbox`_ behaviors.
it_it: Flexbox (o Flex in breve) è un sottoinsieme dei comportamenti del `CSS Flexbox`_.

source: The FreeType extension also supports colored bitmap glyphs such as emojis.
it_it: L'estensione FreeType supporta anche glifi bitmap colorati, come gli emoji.

source: The G2D backend leverages NXP's hardware-accelerated 2D graphics engine available on i.MX processors.
it_it: Il backend G2D sfrutta il motore grafico 2D con accelerazione hardware di NXP disponibile sui processori i.MX.

source: The G2L has a Wayland desktop and the project appears as a Wayland window.
it_it: La G2L ha un desktop Wayland e il progetto appare come una finestra Wayland.

source: The G2UL does not have a desktop so the project is fullscreen and uses the ``fbdev`` driver.
it_it: La G2UL non ha un desktop, quindi il progetto è a schermo intero e utilizza il driver ``fbdev``.

source: The G3E has a Wayland desktop but it should be stopped with ``systemctl stop weston`` before running the default project since it runs in fullscreen using the OpenGL EGL+DRM driver.
it_it: G3E ha un desktop Wayland, ma dovrebbe essere fermato con ``systemctl stop weston`` prima di eseguire il progetto di default, poiché viene eseguito a schermo intero utilizzando il driver OpenGL EGL+DRM.

source: The GDB plugin can be used with any target where GDB is available.
it_it: Il plugin GDB può essere utilizzato con qualsiasi target in cui GDB sia disponibile.

source: The GLFW display/input driver offers support for creating LVGL displays and keyboard/mouse inputs that can be used in an OpenGL context.
it_it: Il driver di visualizzazione/input GLFW offre supporto per la creazione di display LVGL e input da tastiera/mouse utilizzabili in un contesto OpenGL.

source: The GLFW driver can draw textures from the user.
it_it: Il driver GLFW può disegnare le texture dall'utente.

source: The GLFW driver is a quick way to get started on PC-like platforms.
it_it: Il driver GLFW è un modo rapido per iniziare a usare piattaforme simili a PC.

source: The GLFW driver provides automatic window creation and context management with comprehensive input handling for rapid development on PC-like platforms.
it_it: Il driver GLFW fornisce la creazione automatica delle finestre e la gestione del contesto con una gestione completa degli input per uno sviluppo rapido su piattaforme simili a PC.

source: The GPL license is not compatible with the MIT license.
it_it: La licenza GPL non è compatibile con la licenza MIT.

source: The GStreamer extension in LVGL provides video and audio playback capabilities with support for various media formats, streaming protocols, and media sources.
it_it: L'estensione GStreamer in LVGL offre funzionalità di riproduzione video e audio con supporto per vari formati multimediali, protocolli di streaming e sorgenti multimediali.

source: The GStreamer extension requires **GStreamer 1.0** or later with the following components:
it_it: L'estensione GStreamer richiede **GStreamer 1.0** o versione successiva con i seguenti componenti:

source: The GStreamer widget extends the ``lv_image`` widget, which means:
it_it: Il widget GStreamer estende il widget ``lv_image``, il che significa:

source: The GStreamer widget maintains these states:
it_it: Il widget GStreamer mantiene i seguenti stati:

source: The GStreamer widget supports various media sources through different factories:
it_it: Il widget GStreamer supporta diverse sorgenti multimediali tramite diverse factory:

source: The Grid layout is a subset of `CSS Grid`_ layout.
it_it: Il layout "Grid" [a griglia] è un sottoinsieme del layout `CSS Grid`_.

source: The Header occupies the full width of the Background (its parent) and the top approximately 1/2 inch (according to :c:macro:`LV_DPI_DEF`).
it_it: L'intestazione occupa l'intera larghezza del Background (il suo elemento padre) e la parte superiore per circa 1,25 cm (secondo :c:macro:`LV_DPI_DEF`).

source: The IDF project in general are configured to optimize the final application image in respect of its size.
it_it: In generale, il progetto IDF è configurato per ottimizzare l'immagine finale dell'applicazione in base alle sue dimensioni.

source: The ILI9341 LCD controller `driver <https://github.com/lvgl/lvgl/tree/master/src/drivers/display/ili9341>`__ is a platform-agnostic driver, based on the :ref:`generic MIPI driver`.
it_it: Il `driver <https://github.com/lvgl/lvgl/tree/master/src/drivers/display/ili9341>`__ del controller LCD ILI9341 ​​è un driver indipendente dalla piattaforma, basato sul :ref:`driver MIPI generico`.

source: The Image Button is very similar to the simple 'Button' Widget.
it_it: "Image Button" [pulsante immagine] è molto simile al semplice Widget 'Button'.

source: The Inspector allows you to:
it_it: L'Inspector consente di:

source: The Install task copies files that are to be packaged into the holding area **${D}**.
it_it: Il task Install copia i file da impacchettare nell'area di archiviazione **${D}**.

source: The Keyboard Widget is a special :ref:`lv_buttonmatrix` with predefined keymaps and other features to provide an on-screen virtual keyboard to write text into a :ref:`lv_textarea`.
it_it: Il Widget "Keyboard" [tastiera] è una speciale :ref:`lv_buttonmatrix` con mappe dei tasti predefinite e altre funzionalità per fornire una tastiera virtuale su schermo per scrivere testo in una :ref:`lv_textarea`.
